app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = ?  [["track_id", 1]]
---

<% @track.notes.each do |note| %>