app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
    <select id='album-band' name="album[band_id]">
        <% Band.all.each do |band| %>