app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", 2]]
---

<% if @album.tracks.length > 0 %>