app/controllers/albums_controller.rb

    def show
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def new
      @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
      @album = Album.new(album_params)

      if @album.save
---
INSERT INTO "albums" ("name", "year", "band_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "the queen is dead"], ["year", 1986], ["band_id", 2], ["created_at", "2021-10-12 19:03:48.229785"], ["updated_at", "2021-10-12 19:03:48.229785"]]

    def edit
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
      @album = Album.find(params[:id])
      @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]