app/controllers/bands_controller.rb

    def show
      @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
      @band = Band.new(band_params)

      if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Smiths"], ["created_at", "2021-10-12 19:03:36.763939"], ["updated_at", "2021-10-12 19:03:36.763939"]]

    def edit
      @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]