app/controllers/notes_controller.rb

    def create
      note = current_user.notes.new(note_params)
      note.save
---
INSERT INTO "notes" ("track_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["track_id", 2], ["user_id", 4], ["content", "This is cool!"], ["created_at", "2021-10-13 19:57:57.096792"], ["updated_at", "2021-10-13 19:57:57.096792"]]