app/controllers/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @track = Track.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def new
      @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("name", "album_id", "ord", "lyrics") VALUES (?, ?, ?, ?)  [["name", "how soon is now"], ["album_id", 3], ["ord", 12], ["lyrics", "adfaaw ddwwda\r\nhfhahwka"]]
---
    def create
      @track = Track.new(track_params)

      if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = ? WHERE "tracks"."id" = ?  [["lyrics", "I am the son\r\nAnd the heir\r\nOf a shyness that is criminally vulgar\r\nI am the son and heir\r\nOf nothing in particular"], ["id", 1]]
---
    def update
      @track = Track.find(params[:id])
      if @track.update(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 1]]
---
    def destroy
      @track = Track.find(params[:id])
      @track.destroy