app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "VrdFbGM7yYsXEcIV14KULA"], ["updated_at", "2021-10-12 22:27:44.874250"], ["id", 2]]